Masmiseim36/nxpSDK/devices/MKL81Z7/drivers/fsl_dryice.c
/*
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_dryice.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dryice"
#endif

/* all bits defined in the Write Access Control Register. Same positions as Lock Register. */
#define DRYICE_ALL_WAC_MASK 0x00FF3FFFu

/* all bits defined in the Interrupt Enable Register. */
#define DRYICE_ALL_IER_MASK 0x00FF03FDu

/* all bits defined in the Tamper Enable Register. */
#define DRYICE_ALL_TER_MASK 0x00FF03FCu

/*******************************************************************************
 * Code
 ******************************************************************************/
static bool dryice_IsRegisterWriteAllowed(DRY_Type *base, uint32_t mask)
{
    bool retval;

    retval = false;
    mask = mask & DRYICE_ALL_WAC_MASK;

    /* specified LR and WAC bit(s) must be set */
    if ((mask == (mask & base->LR)) && (mask == (mask & base->WAC)))
    {
        retval = true;
    }
    return retval;
}

static bool dryice_IsRegisterReadAllowed(DRY_Type *base, uint32_t mask)
{
    bool retval;

    retval = false;
    mask = mask & DRYICE_ALL_WAC_MASK;

    /* specified RAC bit(s) must be set */
    if (mask == (mask & base->RAC))
    {
        retval = true;
    }
    return retval;
}

static bool dryice_IsKeyReadAllowed(DRY_Type *base, uint32_t keyRegisters)
{
    bool retval;
    uint32_t mask;
    uint32_t drySrac;
    uint32_t drySkrlr;
    uint32_t i;

    retval = true;
    mask = 1u;

    /* limit argument to maximum */
    if (keyRegisters > ARRAY_SIZE(base->SKR))
    {
        keyRegisters = ARRAY_SIZE(base->SKR);
    }

    /* specified SRAC and SKRLR bit(s) must be set */
    drySrac = base->SRAC;
    drySkrlr = base->SKRLR;
    for (i = 0; i < keyRegisters; i++)
    {
        if (((mask & drySrac) == 0) || ((mask & drySkrlr) == 0))
        {
            retval = false;
            break;
        }
    }

    return retval;
}

static bool dryice_IsKeyWriteAllowed(DRY_Type *base, uint32_t keyRegisters)
{
    bool retval;
    uint32_t mask;
    uint32_t drySwac;
    uint32_t drySkwlr;
    uint32_t i;

    retval = true;
    mask = 1u;

    /* limit argument to maximum */
    if (keyRegisters > ARRAY_SIZE(base->SKR))
    {
        keyRegisters = ARRAY_SIZE(base->SKR);
    }

    /* specified SWAC and SKWLR bit(s) must be set */
    drySwac = base->SWAC;
    drySkwlr = base->SKWLR;
    for (i = 0; i < keyRegisters; i++)
    {
        if (((mask & drySwac) == 0) || ((mask & drySkwlr) == 0))
        {
            retval = false;
            break;
        }
    }

    /* if the DryIce tamper flag is set the secure key storage is held in reset and so cannot be written */
    if (retval && (base->SR & DRY_SR_DTF_MASK))
    {
        retval = false;
    }

    return retval;
}

static status_t dryice_PinConfigure(DRY_Type *base, const dryice_pin_config_t *pinConfig, uint32_t pin)
{
    uint32_t temp;
    uint32_t mask;
    status_t status;

    if ((dryice_IsRegisterWriteAllowed(base, DRY_LR_PDL_MASK | DRY_LR_PPL_MASK | ((1u << DRY_LR_GFL_SHIFT) << pin))) &&
        (pinConfig != NULL))
    {
        /* pin 0 to 7 selects bit0 to bit7 */
        mask = (1u << pin);

        /* Pin Direction Register */
        temp = base->PDR;
        temp &= ~mask; /* clear the bit */
        if (kDRYICE_TamperPinDirectionOut == pinConfig->pinDirection)
        {
            temp |= mask; /* set the bit, if configured */
        }
        base->PDR = temp;

        /* Pin Polarity Register */
        temp = base->PPR;
        temp &= ~mask; /* clear the bit */
        if (kDRYICE_TamperPinPolarityExpectInverted == pinConfig->pinPolarity)
        {
            temp |= mask; /* set the bit, if configured */
        }
        base->PPR = temp;

        /* compute and set the configured value to the glitch filter register */
        temp = 0;
        temp |= DRY_PGFR_GFW(pinConfig->glitchFilterWidth);
        temp |= DRY_PGFR_GFP(pinConfig->glitchFilterPrescaler);
#if defined(FSL_FEATURE_DRYICE_HAS_TAMPER_PIN_SAMPLING) && (FSL_FEATURE_DRYICE_HAS_TAMPER_PIN_SAMPLING > 0)
        temp |= DRY_PGFR_TPSW(pinConfig->tamperPinSampleWidth);
        temp |= DRY_PGFR_TPSF(pinConfig->tamperPinSampleFrequency);
#endif
        temp |= DRY_PGFR_TPEX(pinConfig->tamperPinExpected);
        temp |= DRY_PGFR_TPE(pinConfig->tamperPullEnable);
#if defined(FSL_FEATURE_DRYICE_HAS_TAMPER_PIN_PULL_SELECT) && (FSL_FEATURE_DRYICE_HAS_TAMPER_PIN_PULL_SELECT > 0)
        temp |= DRY_PGFR_TPS(pinConfig->tamperPullSelect);
#endif
        /* make sure the glitch filter is disabled when we configure glitch filter width */
        base->PGFR[pin] = temp;
        /* add glitch filter enabled */
        if (pinConfig->glitchFilterEnable)
        {
            temp |= DRY_PGFR_GFE(1u);
            base->PGFR[pin] = temp;
        }
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

static status_t dryice_ActiveTamperConfigure(DRY_Type *base,
                                             const dryice_active_tamper_config_t *activeTamperConfig,
                                             uint32_t activeTamperRegister)
{
    uint32_t temp;
    status_t status;

    /* check if writing to active tamper register is allowed */
    if ((dryice_IsRegisterWriteAllowed(base, (1u << DRY_LR_ATL_SHIFT) << activeTamperRegister)) &&
        (activeTamperConfig != NULL))
    {
        /* compute and set the configured value to the active tamper register */
        temp = 0;
        temp |= DRY_ATR_ATSR(activeTamperConfig->activeTamperShift);
        temp |= DRY_ATR_ATP(activeTamperConfig->activeTamperPolynomial);
        base->ATR[activeTamperRegister] = temp;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

