Masmiseim36/nxpSDK/devices/MKL81Z7/drivers/fsl_dryice.c
    return status;
}

/*!
 * brief Enables the clock gate for the DryIce.
 *
 * This function enables the clock gate for the DryIce peripheral.
 */
void DRYICE_Init(DRY_Type *base)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* ungate clock */
    CLOCK_EnableClock(kCLOCK_Dryice0);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    CLOCK_EnableClock(kCLOCK_Secreg0);
}

/*!
 * brief Disables the clock the DryIce peripheral.
 *
 * This function disables glitch filters and active tampers
 * This function disables the DryIce clock and prescaler in DryIce Control Register.
 * This function disables the clock gate for the DryIce peripheral.
 */
void DRYICE_Deinit(DRY_Type *base)
{
    uint32_t i;

    /* disable all glitch filters and active tampers */
    for (i = 0; i < ARRAY_SIZE(base->PGFR); i++)
    {
        base->PGFR[i] = 0;
    }
    for (i = 0; i < ARRAY_SIZE(base->ATR); i++)
    {
        base->ATR[i] = 0;
    }

    /* disable innter Dryice clock and prescaler */
    base->CR &= ~DRY_CR_DEN_MASK;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* gate clock */
    CLOCK_DisableClock(kCLOCK_Dryice0);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    CLOCK_DisableClock(kCLOCK_Secreg0);
}

/*!
 * brief Gets default values for the DryIce Control Register.
 *
 * This function fills the given structure with default values for the DryIce Control Register.
 * The default values are:
 * code
 *     defaultConfig->innerClockAndPrescalerEnable = true
 *     defaultConfig->tamperForceSystemResetEnable = false
 *     defaultConfig->updateMode = kDRYICE_StatusLockWithTamper
 *     defaultConfig->clockSourceActiveTamper0 = kDRYICE_ClockType1Hz
 *     defaultConfig->clockSourceActiveTamper1 = kDRYICE_ClockType1Hz
 *     defaultConfig->tamperHysteresisSelect = kDRYICE_Hysteresis305mV
 *     defaultConfig->tamperPassiveFilterEnable = false
 *     defaultConfig->tamperDriveStrength = kDRYICE_DriveStrengthLow
 *     defaultConfig->tamperSlewRate = kDRYICE_SlewRateSlow
 *     defaultConfig->secureRegisterFile = kDRYICE_VbatRegisterResetWithTamperOrInterrupt
 *     defaultConfig->prescaler = 0
 * endcode
 * param base DryIce peripheral base address
 * param[out] defaultConfig Pointer to structure to be filled with default parameters
 */
void DRYICE_GetDefaultConfig(DRY_Type *base, dryice_config_t *defaultConfig)
{
    /* Initializes the configure structure to zero. */
    memset(defaultConfig, 0, sizeof(*defaultConfig));

    struct _dryice_config myDefaultConfig =
    {
        true,                         /* innerClockAndPrescalerEnable */
        false,                        /* tamperForceSystemResetEnable */
        kDRYICE_StatusLockWithTamper, /* updateMode */
#if defined(FSL_FEATURE_DRYICE_HAS_ACTIVE_TAMPER_CLOCK_SOURCE_SELECT) && \
    (FSL_FEATURE_DRYICE_HAS_ACTIVE_TAMPER_CLOCK_SOURCE_SELECT > 0)
        kDRYICE_ClockType1Hz, /* clockSourceActiveTamper0 */
        kDRYICE_ClockType1Hz, /* clockSourceActiveTamper1 */
#endif
        kDRYICE_Hysteresis305mV,  /* tamperHysteresisSelect */
        false,                    /* tamperPassiveFilterEnable */
        kDRYICE_DriveStrengthLow, /* tamperDriveStrength */
        kDRYICE_SlewRateSlow,     /* tamperSlewRate */
#if defined(FSL_FEATURE_DRYICE_HAS_SECURE_REGISTER_FILE_SELECT) && \
    (FSL_FEATURE_DRYICE_HAS_SECURE_REGISTER_FILE_SELECT > 0)
        kDRYICE_VbatRegisterResetWithTamperOrInterrupt, /* secureRegisterFile */
#endif
        0, /* prescaler */
    };

    *defaultConfig = myDefaultConfig;
}

/*!
 * brief Writes to the DryIce Control Register.
 *
 * This function writes the given structure to the DryIce Control Register.
 * param base DryIce peripheral base address
 * param config Pointer to structure with DryIce peripheral configuration parameters
 * return kStatus_Fail when writing to DryIce Control Register is not allowed
 * return kStatus_Success when operation completes successfully
 */
status_t DRYICE_SetConfig(DRY_Type *base, const dryice_config_t *config)
{
    uint32_t dryCR;
#if defined(FSL_FEATURE_DRYICE_HAS_ACTIVE_TAMPER_CLOCK_SOURCE_SELECT) && \
    (FSL_FEATURE_DRYICE_HAS_ACTIVE_TAMPER_CLOCK_SOURCE_SELECT > 0)
    uint32_t crATCS;
#endif
    status_t retval;

    /* check if writing to CR is allowed */
    if ((dryice_IsRegisterWriteAllowed(base, DRY_LR_CRL_MASK)) && (config != NULL))
    {
        /* compute CR value */
        dryCR = 0;
        dryCR |= DRY_CR_TFSR(config->tamperForceSystemResetEnable);
        dryCR |= DRY_CR_UM(config->updateMode);
#if defined(FSL_FEATURE_DRYICE_HAS_ACTIVE_TAMPER_CLOCK_SOURCE_SELECT) && \
    (FSL_FEATURE_DRYICE_HAS_ACTIVE_TAMPER_CLOCK_SOURCE_SELECT > 0)
        crATCS = (uint32_t)config->clockSourceActiveTamper0;
        crATCS |= ((uint32_t)config->clockSourceActiveTamper1) << 1u;
        dryCR |= DRY_CR_ATCS(crATCS);
#endif
        dryCR |= DRY_CR_THYS(config->tamperHysteresisSelect);
        dryCR |= DRY_CR_TPFE(config->tamperPassiveFilterEnable);
        dryCR |= DRY_CR_TDSE(config->tamperDriveStrength);
        dryCR |= DRY_CR_TSRE(config->tamperSlewRate);
#if defined(FSL_FEATURE_DRYICE_HAS_SECURE_REGISTER_FILE_SELECT) && \
    (FSL_FEATURE_DRYICE_HAS_SECURE_REGISTER_FILE_SELECT > 0)
        dryCR |= DRY_CR_SRF(config->secureRegisterFile);
#endif
        dryCR |= DRY_CR_DPR(config->prescaler);
        /* write the computed value to the CR register */
        base->CR = dryCR;
        /* after the prescaler is written to CR register, enable the inner dryice clock and prescaler */
        if (config->innerClockAndPrescalerEnable)
        {
            base->CR = dryCR | DRY_CR_DEN_MASK;
        }
        retval = kStatus_Success;
    }
    else
    {
        retval = kStatus_Fail;
    }

    return retval;
}

/*!
 * brief Software reset.
 *
 * This function resets all DryIce registers except WAC, RAC, SRAC, and SWAC. The CR[SWR] field is also not affected;
 * it is reset by VBAT POR only.
 *
 * param base DryIce peripheral base address
 * return kStatus_Fail when writing to DryIce Control Register is not allowed
 * return kStatus_Success when operation completes successfully
 */
status_t DRYICE_SoftwareReset(DRY_Type *base)
{
    status_t retval;

