Masmiseim36/nxpSDK/devices/MKL81Z7/drivers/fsl_dryice.c
    /* check if writing to CR is allowed */
    if (dryice_IsRegisterWriteAllowed(base, DRY_LR_CRL_MASK))
    {
        /* set the CR[SWR] */
        base->CR = DRY_CR_SWR_MASK;
        retval = kStatus_Success;
    }
    else
    {
        retval = kStatus_Fail;
    }

    return retval;
}

/*!
 * brief Writes to the active tamper register(s).
 *
 * This function writes per active tamper register parameters to active tamper register(s).
 *
 * param base DryIce peripheral base address
 * param activeTamperConfig Pointer to structure with active tamper register parameters
 * param activeTamperRegisterSelect Bit mask for active tamper registers to be configured. The passed value is
 *                                   combination of dryice_active_tamper_register_t values (OR'ed).
 * return kStatus_Fail when writing to DryIce Active Tamper Register(s) is not allowed
 * return kStatus_Success when operation completes successfully
 */
status_t DRYICE_ActiveTamperSetConfig(DRY_Type *base,
                                      const dryice_active_tamper_config_t *activeTamperConfig,
                                      uint32_t activeTamperRegisterSelect)
{
    uint32_t mask;
    status_t status;
    uint32_t i;

    mask = 1u;
    status = kStatus_Success;

    /* configure active tamper register by active tamper register, by moving through all active tamper registers */
    for (i = 0; i < ARRAY_SIZE(base->ATR); i++)
    {
        if (activeTamperRegisterSelect & mask)
        {
            /* configure this active tamper register */
            status = dryice_ActiveTamperConfigure(base, activeTamperConfig, i);
            if (status != kStatus_Success)
            {
                break;
            }
        }
        mask = mask << 1u;
    }

    return status;
}

/*!
 * brief Gets default values for tamper pin configuration.
 *
 * This function fills the give structure with default values for the tamper pin and glitch filter configuration.
 * The default values are:
 * code
 *     pinConfig->pinDirection = kDRYICE_TamperPinDirectionIn;
 *     pinConfig->pinPolarity = kDRYICE_TamperPinPolarityExpectNormal;
 *     pinConfig->glitchFilterWidth = 0;
 *     pinConfig->glitchFilterPrescaler = kDRYICE_GlitchFilterClock512Hz;
 *     pinConfig->glitchFilterEnable = false;
 *     pinConfig->tamperPinSampleWidth = kDRYICE_GlitchFilterSampleDisable;
 *     pinConfig->tamperPinSampleFrequency = kDRYICE_GlitchFilterSamplingEveryCycle8;
 *     pinConfig->tamperPinExpected = kDRYICE_GlitchFilterExpectedLogicZero;
 *     pinConfig->tamperPullEnable = false;
 *     pinConfig->tamperPullSelect = kDRYICE_GlitchFilterPullTypeAssert;
 * endcode
 *
 * param base DryIce peripheral base address
 * param[out] pinConfig Pointer to structure to be filled with tamper pins default parameters
 */
void DRYICE_PinGetDefaultConfig(DRY_Type *base, dryice_pin_config_t *pinConfig)
{
    /* Initializes the configure structure to zero. */
    memset(pinConfig, 0, sizeof(*pinConfig));

    struct _dryice_pin_config myPinDefaultConfig =
    {
        kDRYICE_TamperPinDirectionIn,          /* pinDirection */
        kDRYICE_TamperPinPolarityExpectNormal, /* pinPolarity */
        0,                                     /* glitchFilterWidth */
        kDRYICE_GlitchFilterClock512Hz,        /* glitchFilterPrescaler */
        false,                                 /* glitchFilterEnable */
#if defined(FSL_FEATURE_DRYICE_HAS_TAMPER_PIN_SAMPLING) && (FSL_FEATURE_DRYICE_HAS_TAMPER_PIN_SAMPLING > 0)
        kDRYICE_GlitchFilterSampleDisable,       /* tamperPinSampleWidth */
        kDRYICE_GlitchFilterSamplingEveryCycle8, /* tamperPinSampleFrequency */
#endif
        kDRYICE_GlitchFilterExpectedLogicZero, /* tamperPinExpected */
        false,                                 /* tamperPullEnable */
#if defined(FSL_FEATURE_DRYICE_HAS_TAMPER_PIN_PULL_SELECT) && (FSL_FEATURE_DRYICE_HAS_TAMPER_PIN_PULL_SELECT > 0)
        kDRYICE_GlitchFilterPullTypeAssert, /* tamperPullSelect */
#endif
    };

    *pinConfig = myPinDefaultConfig;
}

/*!
 * brief Writes the tamper pin configuration.
 *
 * This function writes per pin parameters to tamper pin and glitch filter configuration registers.
 *
 * param base DryIce peripheral base address
 * param pinConfig Pointer to structure with tamper pin and glitch filter configuration parameters
 * param pinSelect Bit mask for tamper pins to be configured. The passed value is combination of
 *                  enum _dryice_tamper_pin (dryice_tamper_pin_t) values (OR'ed).
 * return kStatus_Fail when writing to DryIce Pin Direction, Pin Polarity or Glitch Filter Register(s) is not allowed
 * return kStatus_Success when operation completes successfully
 */
status_t DRYICE_PinSetConfig(DRY_Type *base, const dryice_pin_config_t *pinConfig, uint32_t pinSelect)
{
    uint32_t mask;
    status_t status;
    uint32_t i;

    mask = 1u;
    status = kStatus_Success;

    /* configure pin by pin, by moving through all selected pins */
    for (i = 0; i < ARRAY_SIZE(base->PGFR); i++)
    {
        if (pinSelect & mask)
        {
            /* clear this pin from pinSelect */
            pinSelect &= ~mask;

            /* configure this pin */
            status = dryice_PinConfigure(base, pinConfig, i);

            /* if pinSelect is zero, we have configured all pins selected by pinSelect, so skip */
            if ((status != kStatus_Success) || (0 == pinSelect))
            {
                break;
            }
        }
        mask = mask << 1u;
    }

    return status;
}

/*!
 * brief Reads the Secure Key Register(s).
 *
 * This function reads actual value from Secure Key Register(s).
 *
 * param base DryIce peripheral base address
 * param[out] key Pointer to storage array (application buffer)
 * param keySize Storage array size in bytes
 * return kStatus_Fail if reading is not allowed (read access disabled or key argument is NULL)
 * return kStatus_Success when secure keys have been written to input storage array
 */
status_t DRYICE_GetKey(DRY_Type *base, uint8_t *key, size_t keySize)
{
    status_t status;
    uint32_t keyRegisters;
    uint32_t readKey[ARRAY_SIZE(base->SKR)] = {0};
    void *pKey;
    uint32_t i;

    /* compute number of 32-bit secure key registers to cover keySize bytes */
    keyRegisters = keySize / sizeof(uint32_t);
    if (keySize % sizeof(uint32_t))
    {
        keyRegisters++;
    }
    if (keyRegisters > ARRAY_SIZE(base->SKR))
    {
        keyRegisters = ARRAY_SIZE(base->SKR);
    }

