Masmiseim36/nxpSDK/devices/MKL81Z7/drivers/fsl_dryice.c
    if ((dryice_IsKeyReadAllowed(base, keyRegisters)) && (key != NULL))
    {
        /* read locally the secure key registers */
        for (i = 0; i < keyRegisters; i++)
        {
            readKey[i] = base->SKR[i];
        }

        /* memcpy to user buffer */
        pKey = readKey;
        for (i = 0; i < keySize; i++)
        {
            key[i] = ((uint8_t *)pKey)[i];
        }

        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Writes the Secure Key Register(s).
 *
 * This function writes given data to Secure Key Register(s).
 *
 * param base DryIce peripheral base address
 * param key Pointer to key to be stored in the DryIce peripheral
 * param keySize Key size in bytes
 * return kStatus_Fail if writing is not allowed (locked or write access disabled or key argument is NULL)
 * return kStatus_Success when Secure Key Register(s) have been written with new values
 */
status_t DRYICE_WriteKey(DRY_Type *base, const uint8_t *key, size_t keySize)
{
    status_t status = kStatus_Fail;
    uint32_t keyRegisters;
    uint32_t writeKey[ARRAY_SIZE(base->SKR)] = {0};
    void *pKey;
    uint32_t i;

    /* compute number of 32-bit secure key registers to cover keySize bytes */
    keyRegisters = keySize / sizeof(uint32_t);
    if (keySize % sizeof(uint32_t))
    {
        keyRegisters++;
    }
    if (keyRegisters > ARRAY_SIZE(base->SKR))
    {
        keyRegisters = ARRAY_SIZE(base->SKR);
    }

    /* invalidate secure key registers */
    if (key && keyRegisters)
    {
        base->SKVR = 0xFFu;
        status = kStatus_Success;
    }

    if ((kStatus_Success == status) && (dryice_IsKeyWriteAllowed(base, keyRegisters)))
    {
        /* memcpy to local buffer */
        pKey = writeKey;
        for (i = 0; i < keySize; i++)
        {
            ((uint8_t *)pKey)[i] = key[i];
        }

        /* write the secure key registers */
        for (i = 0; i < keyRegisters; i++)
        {
            base->SKR[i] = writeKey[i];
        }
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Reads the Status Register.
 *
 * This function reads flag bits from DryIce Status Register.
 *
 * param base DryIce peripheral base address
 * param[out] result Pointer to uint32_t where to write Status Register read value. Use dryice_status_flag_t to decode
 *                    individual flags.
 * return kStatus_Fail when Status Register reading is not allowed
 * return kStatus_Success when result is written with the Status Register read value
 */
status_t DRYICE_GetStatusFlags(DRY_Type *base, uint32_t *result)
{
    status_t status;

    if ((dryice_IsRegisterReadAllowed(base, DRY_RAC_SRR_MASK)) && (result != NULL))
    {
        *result = base->SR;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Writes to the Status Register.
 *
 * This function clears specified flag bits in DryIce Status Register.
 *
 * param base DryIce peripheral base address
 * param mask Bit mask for the flag bits to be cleared. Use dryice_status_flag_t to encode flags.
 * return kStatus_Fail when Status Register writing is not allowed
 * return kStatus_Success when mask is written to the Status Register
 */
status_t DRYICE_ClearStatusFlags(DRY_Type *base, uint32_t mask)
{
    status_t status;

    if (dryice_IsRegisterWriteAllowed(base, DRY_WAC_SRW_MASK))
    {
        base->SR = mask;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Writes to the Interrupt Enable Register.
 *
 * This function sets specified interrupt enable bits in DryIce Interrupt Enable Register.
 *
 * param base DryIce peripheral base address
 * param mask Bit mask for the interrupt enable bits to be set.
 * return kStatus_Fail when Interrupt Enable Register writing is not allowed
 * return kStatus_Success when mask is written to the Interrupt Enable Register
 */
status_t DRYICE_EnableInterrupts(DRY_Type *base, uint32_t mask)
{
    status_t status;

    mask = mask & DRYICE_ALL_IER_MASK; /* only set the bits documented in Reference Manual. */
    if (dryice_IsRegisterWriteAllowed(base, DRY_WAC_IEW_MASK))
    {
        base->IER |= mask;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Writes to the Interrupt Enable Register.
 *
 * This function clears specified interrupt enable bits in DryIce Interrupt Enable Register.
 *
 * param base DryIce peripheral base address
 * param mask Bit mask for the interrupt enable bits to be cleared.
 * return kStatus_Fail when Interrupt Enable Register writing is not allowed
 * return kStatus_Success when specified bits are cleared in the Interrupt Enable Register
 */
status_t DRYICE_DisableInterrupts(DRY_Type *base, uint32_t mask)
{
    status_t status;

    mask = mask & DRYICE_ALL_IER_MASK; /* only clear the bits documented in Reference Manual.  */
    if (dryice_IsRegisterWriteAllowed(base, DRY_WAC_IEW_MASK))
    {
        base->IER &= ~mask;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Writes to the Tamper Enable Register.
 *
 * This function sets specified tamper enable bits in DryIce Tamper Enable Register.
 *
 * param base DryIce peripheral base address
 * param mask Bit mask for the tamper enable bits to be set.
 * return kStatus_Fail when Tamper Enable Register writing is not allowed
 * return kStatus_Success when mask is written to the Tamper Enable Register
 */
status_t DRYICE_EnableTampers(DRY_Type *base, uint32_t mask)
{
    status_t status;

    mask = mask & DRYICE_ALL_TER_MASK; /* only set the bits documented in Reference Manual */
    if (dryice_IsRegisterWriteAllowed(base, DRY_WAC_TEW_MASK))
    {
        base->TER |= mask;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

