Masmiseim36/nxpSDK/devices/MKL81Z7/drivers/fsl_dryice.c
    return status;
}

/*!
 * brief Writes to the Tamper Enable Register.
 *
 * This function clears specified tamper enable bits in DryIce Tamper Enable Register.
 *
 * param base DryIce peripheral base address
 * param mask Bit mask for the tamper enable bits to be cleared.
 * return kStatus_Fail when Tamper Enable Register writing is not allowed
 * return kStatus_Success when specified bits are cleared in the Tamper Enable Register
 */
status_t DRYICE_DisableTampers(DRY_Type *base, uint32_t mask)
{
    status_t status;

    mask = mask & DRYICE_ALL_TER_MASK; /* only clear the bits documented in Reference Manual */
    if (dryice_IsRegisterWriteAllowed(base, DRY_WAC_TEW_MASK))
    {
        base->TER &= ~mask;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Writes to the Tamper Seconds Register.
 *
 * This function writes to DryIce Tamper Seconds Register. This causes Status Register DTF flag to be set (DryIce
 * tampering detected).
 *
 * param base DryIce peripheral base address
 * return kStatus_Fail when Tamper Seconds Register writing is not allowed
 * return kStatus_Success when Tamper Seconds Register is written
 */
status_t DRYICE_ForceTamper(DRY_Type *base)
{
    status_t status;

    if (dryice_IsRegisterWriteAllowed(base, DRY_WAC_TSRW_MASK))
    {
        base->TSR = 0;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Reads the Tamper Seconds Register.
 *
 * This function reads DryIce Tamper Seconds Register. The read value returns the time in seconds at which the Status
 * Register DTF flag was set.
 *
 * param base DryIce peripheral base address
 * param tamperTimeSeconds Time in seconds at which the tamper detection SR[DTF] flag was set.
 * return kStatus_Fail when Tamper Seconds Register reading is not allowed
 * return kStatus_Success when Tamper Seconds Register is read
 */
status_t DRYICE_GetTamperTimeSeconds(DRY_Type *base, uint32_t *tamperTimeSeconds)
{
    status_t status;

    if ((dryice_IsRegisterReadAllowed(base, DRY_RAC_TSRR_MASK)) && (tamperTimeSeconds != NULL))
    {
        *tamperTimeSeconds = base->TSR;
        status = kStatus_Success;
    }
    else
    {
        status = kStatus_Fail;
    }

    return status;
}

/*!
 * brief Writes to the DryIce Lock Register.
 *
 * This function clears specified lock bits in the DryIce Lock Register.
 * When a lock bit is clear, a write to corresponding DryIce Register is ignored.
 * Once cleared, these bits can only be set by VBAT POR or software reset.
 *
 * param base DryIce peripheral base address
 * param mask Bit mask for the lock bits to be cleared. Use dryice_register_t values to encode (OR'ed) which DryIce
 * Registers shall be locked.
 */
void DRYICE_LockRegisters(DRY_Type *base, uint32_t mask)
{
    mask &= kDRYICE_AllRegisters; /* make sure only documented registers are selected by the mask */
    base->LR &= ~mask;            /* clear the selected bits */
}

/*!
 * brief Writes to DryIce Secure Key Lock Registers.
 *
 * This function clears specified lock bits in the DryIce Secure Key Write or Secure Key Read Lock Registers.
 * When a lock bit is clear, a read/write from/to corresponding DryIce Secure Key Register is ignored.
 * Once cleared, these bits can only be set by VBAT POR or software reset.
 *
 * param base DryIce peripheral base address
 * param mask Bit mask for the lock bits to be cleared. Use dryice_secure_key_t values to encode (OR'ed) which DryIce
 *             Secure Key Registers shall be locked.
 * param readWrite Select Read or Write (or ReadWrite) lock.
 */
void DRYICE_LockSecureKeys(DRY_Type *base, uint32_t mask, dryice_readwrite_t readWrite)
{
    mask &= kDRYICE_AllSecureKeys; /* make sure only documented secure key registers are selected by the mask */
    if ((readWrite == kDRYICE_Read) || (readWrite == kDRYICE_ReadWrite))
    {
        base->SKRLR &= ~mask;
    }
    if ((readWrite == kDRYICE_Write) || (readWrite == kDRYICE_ReadWrite))
    {
        base->SKWLR &= ~mask;
    }
}

/*!
 * brief Writes to DryIce Access Control Registers.
 *
 * This function clears specified access control bits in the DryIce Access Control Registers.
 * When an access control bit is clear, a read/write from/to corresponding DryIce Register or Secure Key Register is
 * ignored.
 * Once cleared, these bits can only be set by VBAT POR or software reset.
 *
 * param base DryIce peripheral base address
 * param maskRegisters Bit mask for the access control bits to be cleared. Use dryice_register_t values to encode
 *                      (OR'ed) which DryIce Registers shall be access controlled.
 * param maskKeys Bit mask for the access control bits to be cleared. Use dryice_secure_key_t values to encode (OR'ed)
 *                 which DryIce Secure Key Registers shall be access controlled.
 * param readWrite Disallow Read or Write (or ReadWrite).
 */
void DRYICE_DisableAccess(DRY_Type *base, uint32_t maskRegisters, uint32_t maskKeys, dryice_readwrite_t readWrite)
{
    maskRegisters &= kDRYICE_AllRegisters; /* make sure only documented registers are selected by the mask */
    maskKeys &= kDRYICE_AllSecureKeys;     /* make sure only documented secure key registers are selected by the mask */

    if ((readWrite == kDRYICE_Read) || (readWrite == kDRYICE_ReadWrite))
    {
        base->RAC &= ~maskRegisters;
        base->SRAC &= ~maskKeys;
    }
    if ((readWrite == kDRYICE_Write) || (readWrite == kDRYICE_ReadWrite))
    {
        base->WAC &= ~maskRegisters;
        base->SWAC &= ~maskKeys;
    }
}
